stm32duino/Arduino_Core_STM32/boards.txt
# DEMO_F030F4_16M board
GenF0.menu.pnum.DEMO_F030F4_16M=STM32F030F4 Demo board (16Mhz)
GenF0.menu.pnum.DEMO_F030F4_16M.upload.maximum_data_size=4096
GenF0.menu.pnum.DEMO_F030F4_16M.upload.maximum_size=16384
GenF0.menu.pnum.DEMO_F030F4_16M.build.board=DEMO_F030F4_16M
GenF0.menu.pnum.DEMO_F030F4_16M.build.product_line=STM32F030x6
GenF0.menu.pnum.DEMO_F030F4_16M.build.variant=DEMO_F030F4

# DEMO_F030F4_HSI board
GenF0.menu.pnum.DEMO_F030F4_HSI=STM32F030F4 Demo board (internal RC oscillator)
GenF0.menu.pnum.DEMO_F030F4_HSI.upload.maximum_data_size=4096
GenF0.menu.pnum.DEMO_F030F4_HSI.upload.maximum_size=16384
GenF0.menu.pnum.DEMO_F030F4_HSI.build.board=DEMO_F030F4_HSI
GenF0.menu.pnum.DEMO_F030F4_HSI.build.product_line=STM32F030x6
GenF0.menu.pnum.DEMO_F030F4_HSI.build.variant=DEMO_F030F4

# Upload menu
GenF0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF0.menu.upload_method.swdMethod.upload.protocol=0
GenF0.menu.upload_method.swdMethod.upload.options=-g
GenF0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF0.menu.upload_method.serialMethod.upload.protocol=1
GenF0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF0.menu.upload_method.dfuMethod.upload.protocol=2
GenF0.menu.upload_method.dfuMethod.upload.options=-g
GenF0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic F1
GenF1.name=Generic STM32F1 series

GenF1.build.core=arduino
GenF1.build.board=GenF1
GenF1.build.mcu=cortex-m3
GenF1.build.series=STM32F1xx
GenF1.build.cmsis_lib_gcc=arm_cortexM3l_math
GenF1.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}

# BLUEPILL_F103C6 board
GenF1.menu.pnum.BLUEPILL_F103C6=BluePill F103C6 (32K)
GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_size=32768
GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_data_size=10240
GenF1.menu.pnum.BLUEPILL_F103C6.build.board=BLUEPILL_F103C6
GenF1.menu.pnum.BLUEPILL_F103C6.build.product_line=STM32F103x6
GenF1.menu.pnum.BLUEPILL_F103C6.build.variant=PILL_F103XX

# BLUEPILL_F103C8 board
GenF1.menu.pnum.BLUEPILL_F103C8=BluePill F103C8
GenF1.menu.pnum.BLUEPILL_F103C8.upload.maximum_size=65536
GenF1.menu.pnum.BLUEPILL_F103C8.upload.maximum_data_size=20480
GenF1.menu.pnum.BLUEPILL_F103C8.build.board=BLUEPILL_F103C8
GenF1.menu.pnum.BLUEPILL_F103C8.build.product_line=STM32F103xB
GenF1.menu.pnum.BLUEPILL_F103C8.build.variant=PILL_F103XX

GenF1.menu.pnum.BLUEPILL_F103CB=BluePill F103CB (or C8 with 128k)
GenF1.menu.pnum.BLUEPILL_F103CB.upload.maximum_size=131072
GenF1.menu.pnum.BLUEPILL_F103CB.upload.maximum_data_size=20480
GenF1.menu.pnum.BLUEPILL_F103CB.build.board=BLUEPILL_F103CB
GenF1.menu.pnum.BLUEPILL_F103CB.build.product_line=STM32F103xB
GenF1.menu.pnum.BLUEPILL_F103CB.build.variant=PILL_F103XX

# BLACKPILL_F103C8 board
GenF1.menu.pnum.BLACKPILL_F103C8=BlackPill F103C8
GenF1.menu.pnum.BLACKPILL_F103C8.upload.maximum_size=65536
GenF1.menu.pnum.BLACKPILL_F103C8.upload.maximum_data_size=20480
GenF1.menu.pnum.BLACKPILL_F103C8.build.board=BLACKPILL_F103C8
GenF1.menu.pnum.BLACKPILL_F103C8.build.product_line=STM32F103xB
GenF1.menu.pnum.BLACKPILL_F103C8.build.variant=PILL_F103XX

GenF1.menu.pnum.BLACKPILL_F103CB=BlackPill F103CB (or C8 with 128k)
GenF1.menu.pnum.BLACKPILL_F103CB.upload.maximum_size=131072
GenF1.menu.pnum.BLACKPILL_F103CB.upload.maximum_data_size=20480
GenF1.menu.pnum.BLACKPILL_F103CB.build.board=BLACKPILL_F103CB
GenF1.menu.pnum.BLACKPILL_F103CB.build.product_line=STM32F103xB
GenF1.menu.pnum.BLACKPILL_F103CB.build.variant=PILL_F103XX

# Generic STM32F103Cx boards
GenF1.menu.pnum.Generic_F103C4=Generic F103C4
GenF1.menu.pnum.Generic_F103C4.upload.maximum_size=16384
GenF1.menu.pnum.Generic_F103C4.upload.maximum_data_size=6144
GenF1.menu.pnum.Generic_F103C4.build.board=GENERIC_F103C4
GenF1.menu.pnum.Generic_F103C4.build.product_line=STM32F103x6
GenF1.menu.pnum.Generic_F103C4.build.variant=Generic_F103Cx

GenF1.menu.pnum.Generic_F103C6=Generic F103C6
GenF1.menu.pnum.Generic_F103C6.upload.maximum_size=32768
GenF1.menu.pnum.Generic_F103C6.upload.maximum_data_size=10240
GenF1.menu.pnum.Generic_F103C6.build.board=GENERIC_F103C6
GenF1.menu.pnum.Generic_F103C6.build.product_line=STM32F103x6
GenF1.menu.pnum.Generic_F103C6.build.variant=Generic_F103Cx

GenF1.menu.pnum.Generic_F103C8=Generic F103C8
GenF1.menu.pnum.Generic_F103C8.upload.maximum_size=65536
GenF1.menu.pnum.Generic_F103C8.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103C8.build.board=GENERIC_F103C8
GenF1.menu.pnum.Generic_F103C8.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103C8.build.variant=Generic_F103Cx

GenF1.menu.pnum.Generic_F103CB=Generic F103CB
GenF1.menu.pnum.Generic_F103CB.upload.maximum_size=131072
GenF1.menu.pnum.Generic_F103CB.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103CB.build.board=GENERIC_F103CB
GenF1.menu.pnum.Generic_F103CB.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103CB.build.variant=Generic_F103Cx

# Generic STM32F103Rx boards
GenF1.menu.pnum.Generic_F103R4=Generic F103R4
GenF1.menu.pnum.Generic_F103R4.upload.maximum_size=16384
GenF1.menu.pnum.Generic_F103R4.upload.maximum_data_size=6144
GenF1.menu.pnum.Generic_F103R4.build.board=GENERIC_F103R4
GenF1.menu.pnum.Generic_F103R4.build.product_line=STM32F103x6
GenF1.menu.pnum.Generic_F103R4.build.variant=Generic_F103Rx

GenF1.menu.pnum.Generic_F103R6=Generic F103R6
GenF1.menu.pnum.Generic_F103R6.upload.maximum_size=32768
GenF1.menu.pnum.Generic_F103R6.upload.maximum_data_size=10240
GenF1.menu.pnum.Generic_F103R6.build.board=GENERIC_F103R6
GenF1.menu.pnum.Generic_F103R6.build.product_line=STM32F103x6
GenF1.menu.pnum.Generic_F103R6.build.variant=Generic_F103Rx

GenF1.menu.pnum.Generic_F103R8=Generic F103R8
GenF1.menu.pnum.Generic_F103R8.upload.maximum_size=65536
GenF1.menu.pnum.Generic_F103R8.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103R8.build.board=GENERIC_F103R8
GenF1.menu.pnum.Generic_F103R8.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103R8.build.variant=Generic_F103Rx

GenF1.menu.pnum.Generic_F103RB=Generic F103RB
GenF1.menu.pnum.Generic_F103RB.upload.maximum_size=131072
GenF1.menu.pnum.Generic_F103RB.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103RB.build.board=GENERIC_F103RB
GenF1.menu.pnum.Generic_F103RB.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103RB.build.variant=Generic_F103Rx

GenF1.menu.pnum.Generic_F103RC=Generic F103RC
GenF1.menu.pnum.Generic_F103RC.upload.maximum_size=262144
GenF1.menu.pnum.Generic_F103RC.upload.maximum_data_size=49152
GenF1.menu.pnum.Generic_F103RC.build.board=GENERIC_F103RC
GenF1.menu.pnum.Generic_F103RC.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103RC.build.variant=Generic_F103Rx

GenF1.menu.pnum.Generic_F103RD=Generic F103RD
GenF1.menu.pnum.Generic_F103RD.upload.maximum_size=393216
GenF1.menu.pnum.Generic_F103RD.upload.maximum_data_size=65536
GenF1.menu.pnum.Generic_F103RD.build.board=GENERIC_F103RD
GenF1.menu.pnum.Generic_F103RD.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103RD.build.variant=Generic_F103Rx

