stm32duino/Arduino_Core_STM32/boards.txt
GenF1.menu.pnum.Generic_F103RE=Generic F103RE
GenF1.menu.pnum.Generic_F103RE.upload.maximum_size=524288
GenF1.menu.pnum.Generic_F103RE.upload.maximum_data_size=65536
GenF1.menu.pnum.Generic_F103RE.build.board=GENERIC_F103RE
GenF1.menu.pnum.Generic_F103RE.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103RE.build.variant=Generic_F103Rx

GenF1.menu.pnum.Generic_F103RF=Generic F103RF
GenF1.menu.pnum.Generic_F103RF.upload.maximum_size=786432
GenF1.menu.pnum.Generic_F103RF.upload.maximum_data_size=98304
GenF1.menu.pnum.Generic_F103RF.build.board=GENERIC_F103RF
GenF1.menu.pnum.Generic_F103RF.build.product_line=STM32F103xG
GenF1.menu.pnum.Generic_F103RF.build.variant=Generic_F103Rx

GenF1.menu.pnum.Generic_F103RG=Generic F103RG
GenF1.menu.pnum.Generic_F103RG.upload.maximum_size=1048576
GenF1.menu.pnum.Generic_F103RG.upload.maximum_data_size=98304
GenF1.menu.pnum.Generic_F103RG.build.board=GENERIC_F103RG
GenF1.menu.pnum.Generic_F103RG.build.product_line=STM32F103xG
GenF1.menu.pnum.Generic_F103RG.build.variant=Generic_F103Rx

# Generic STM32F103Tx boards
GenF1.menu.pnum.Generic_F103T4=Generic F103T4
GenF1.menu.pnum.Generic_F103T4.upload.maximum_size=16384
GenF1.menu.pnum.Generic_F103T4.upload.maximum_data_size=6144
GenF1.menu.pnum.Generic_F103T4.build.board=GENERIC_F103T4
GenF1.menu.pnum.Generic_F103T4.build.product_line=STM32F103x6
GenF1.menu.pnum.Generic_F103T4.build.variant=Generic_F103Tx

GenF1.menu.pnum.Generic_F103T6=Generic F103T6
GenF1.menu.pnum.Generic_F103T6.upload.maximum_size=32768
GenF1.menu.pnum.Generic_F103T6.upload.maximum_data_size=10240
GenF1.menu.pnum.Generic_F103T6.build.board=GENERIC_F103T6
GenF1.menu.pnum.Generic_F103T6.build.product_line=STM32F103x6
GenF1.menu.pnum.Generic_F103T6.build.variant=Generic_F103Tx

GenF1.menu.pnum.Generic_F103T8=Generic F103T8
GenF1.menu.pnum.Generic_F103T8.upload.maximum_size=65536
GenF1.menu.pnum.Generic_F103T8.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103T8.build.board=GENERIC_F103T8
GenF1.menu.pnum.Generic_F103T8.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103T8.build.variant=Generic_F103Tx

GenF1.menu.pnum.Generic_F103TB=Generic F103TB
GenF1.menu.pnum.Generic_F103TB.upload.maximum_size=131072
GenF1.menu.pnum.Generic_F103TB.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103TB.build.board=GENERIC_F103TB
GenF1.menu.pnum.Generic_F103TB.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103TB.build.variant=Generic_F103Tx

# Generic STM32F103Vx boards
GenF1.menu.pnum.Generic_F103V8=Generic F103V8
GenF1.menu.pnum.Generic_F103V8.upload.maximum_size=65536
GenF1.menu.pnum.Generic_F103V8.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103V8.build.board=GENERIC_F103V8
GenF1.menu.pnum.Generic_F103V8.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103V8.build.variant=Generic_F103Vx

GenF1.menu.pnum.Generic_F103VB=Generic F103VB
GenF1.menu.pnum.Generic_F103VB.upload.maximum_size=131072
GenF1.menu.pnum.Generic_F103VB.upload.maximum_data_size=20480
GenF1.menu.pnum.Generic_F103VB.build.board=GENERIC_F103VB
GenF1.menu.pnum.Generic_F103VB.build.product_line=STM32F103xB
GenF1.menu.pnum.Generic_F103VB.build.variant=Generic_F103Vx

GenF1.menu.pnum.Generic_F103VC=Generic F103VC
GenF1.menu.pnum.Generic_F103VC.upload.maximum_size=262144
GenF1.menu.pnum.Generic_F103VC.upload.maximum_data_size=49152
GenF1.menu.pnum.Generic_F103VC.build.board=GENERIC_F103VC
GenF1.menu.pnum.Generic_F103VC.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103VC.build.variant=Generic_F103Vx

GenF1.menu.pnum.Generic_F103VD=Generic F103VD
GenF1.menu.pnum.Generic_F103VD.upload.maximum_size=393216
GenF1.menu.pnum.Generic_F103VD.upload.maximum_data_size=65536
GenF1.menu.pnum.Generic_F103VD.build.board=GENERIC_F103VD
GenF1.menu.pnum.Generic_F103VD.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103VD.build.variant=Generic_F103Vx

GenF1.menu.pnum.Generic_F103VE=Generic F103VE
GenF1.menu.pnum.Generic_F103VE.upload.maximum_size=524288
GenF1.menu.pnum.Generic_F103VE.upload.maximum_data_size=65536
GenF1.menu.pnum.Generic_F103VE.build.board=GENERIC_F103VE
GenF1.menu.pnum.Generic_F103VE.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103VE.build.variant=Generic_F103Vx

GenF1.menu.pnum.Generic_F103VF=Generic F103VF
GenF1.menu.pnum.Generic_F103VF.upload.maximum_size=786432
GenF1.menu.pnum.Generic_F103VF.upload.maximum_data_size=98304
GenF1.menu.pnum.Generic_F103VF.build.board=GENERIC_F103VF
GenF1.menu.pnum.Generic_F103VF.build.product_line=STM32F103xG
GenF1.menu.pnum.Generic_F103VF.build.variant=Generic_F103Vx

GenF1.menu.pnum.Generic_F103VG=Generic F103VG
GenF1.menu.pnum.Generic_F103VG.upload.maximum_size=1048576
GenF1.menu.pnum.Generic_F103VG.upload.maximum_data_size=98304
GenF1.menu.pnum.Generic_F103VG.build.board=GENERIC_F103VG
GenF1.menu.pnum.Generic_F103VG.build.product_line=STM32F103xG
GenF1.menu.pnum.Generic_F103VG.build.variant=Generic_F103Vx

# Generic STM32F103Zx boards
GenF1.menu.pnum.Generic_F103ZC=Generic F103ZC
GenF1.menu.pnum.Generic_F103ZC.upload.maximum_size=262144
GenF1.menu.pnum.Generic_F103ZC.upload.maximum_data_size=49152
GenF1.menu.pnum.Generic_F103ZC.build.board=Generic_F103ZC
GenF1.menu.pnum.Generic_F103ZC.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103ZC.build.variant=Generic_F103Zx

GenF1.menu.pnum.Generic_F103ZD=Generic F103ZD
GenF1.menu.pnum.Generic_F103ZD.upload.maximum_size=393216
GenF1.menu.pnum.Generic_F103ZD.upload.maximum_data_size=65536
GenF1.menu.pnum.Generic_F103ZD.build.board=Generic_F103ZC
GenF1.menu.pnum.Generic_F103ZD.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103ZD.build.variant=Generic_F103Zx

GenF1.menu.pnum.Generic_F103ZE=Generic F103ZE
GenF1.menu.pnum.Generic_F103ZE.upload.maximum_size=524288
GenF1.menu.pnum.Generic_F103ZE.upload.maximum_data_size=65536
GenF1.menu.pnum.Generic_F103ZE.build.board=Generic_F103ZE
GenF1.menu.pnum.Generic_F103ZE.build.product_line=STM32F103xE
GenF1.menu.pnum.Generic_F103ZE.build.variant=Generic_F103Zx

GenF1.menu.pnum.Generic_F103ZF=Generic F103ZF
GenF1.menu.pnum.Generic_F103ZF.upload.maximum_size=786432
GenF1.menu.pnum.Generic_F103ZF.upload.maximum_data_size=98304
GenF1.menu.pnum.Generic_F103ZF.build.board=Generic_F103ZF
GenF1.menu.pnum.Generic_F103ZF.build.product_line=STM32F103xG
GenF1.menu.pnum.Generic_F103ZF.build.variant=Generic_F103Zx

GenF1.menu.pnum.Generic_F103ZG=Generic F103ZG
GenF1.menu.pnum.Generic_F103ZG.upload.maximum_size=1048576
GenF1.menu.pnum.Generic_F103ZG.upload.maximum_data_size=98304
GenF1.menu.pnum.Generic_F103ZG.build.board=Generic_F103ZG
GenF1.menu.pnum.Generic_F103ZG.build.product_line=STM32F103xG
GenF1.menu.pnum.Generic_F103ZG.build.variant=Generic_F103Zx

# VCCGND_F103ZET6 board
GenF1.menu.pnum.VCCGND_F103ZET6Mini=VCCGND F103ZET6 Mini
GenF1.menu.pnum.VCCGND_F103ZET6Mini.upload.maximum_size=524288
GenF1.menu.pnum.VCCGND_F103ZET6Mini.upload.maximum_data_size=65536
GenF1.menu.pnum.VCCGND_F103ZET6Mini.build.board=VCCGND_F103ZET6_MINI
GenF1.menu.pnum.VCCGND_F103ZET6Mini.build.product_line=STM32F103xE
GenF1.menu.pnum.VCCGND_F103ZET6Mini.build.variant=Generic_F103Zx

GenF1.menu.pnum.VCCGND_F103ZET6=VCCGND F103ZET6
GenF1.menu.pnum.VCCGND_F103ZET6.upload.maximum_size=524288
GenF1.menu.pnum.VCCGND_F103ZET6.upload.maximum_data_size=65536
GenF1.menu.pnum.VCCGND_F103ZET6.build.board=VCCGND_F103ZET6
GenF1.menu.pnum.VCCGND_F103ZET6.build.product_line=STM32F103xE
GenF1.menu.pnum.VCCGND_F103ZET6.build.variant=Generic_F103Zx

# HY-TinySTM103TB board
GenF1.menu.pnum.HY_TinySTM103TB=HY-TinySTM103TB
GenF1.menu.pnum.HY_TinySTM103TB.upload.maximum_size=131072
GenF1.menu.pnum.HY_TinySTM103TB.upload.maximum_data_size=20480
GenF1.menu.pnum.HY_TinySTM103TB.build.board=HY_TinySTM103TB
GenF1.menu.pnum.HY_TinySTM103TB.build.product_line=STM32F103xB
GenF1.menu.pnum.HY_TinySTM103TB.build.variant=HY_TinySTM103T

# MAPLEMINI_F103CB board
GenF1.menu.pnum.MAPLEMINI_F103CB=Maple Mini F103CB
GenF1.menu.pnum.MAPLEMINI_F103CB.upload.maximum_size=131072
GenF1.menu.pnum.MAPLEMINI_F103CB.upload.maximum_data_size=20480
GenF1.menu.pnum.MAPLEMINI_F103CB.build.board=MAPLEMINI_F103CB
GenF1.menu.pnum.MAPLEMINI_F103CB.build.product_line=STM32F103xB
GenF1.menu.pnum.MAPLEMINI_F103CB.build.variant=MAPLEMINI_F103CB


# Upload menu
GenF1.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF1.menu.upload_method.swdMethod.upload.protocol=0
GenF1.menu.upload_method.swdMethod.upload.options=-g
GenF1.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF1.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF1.menu.upload_method.serialMethod.upload.protocol=1
GenF1.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF1.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

